// import 'package:flutter/material.dart';

// const Text text = Text("سياسة خاصة
// يرجى قراءة سياسة الخصوصية الخاصة بنا بعناية للحصول على فهم واضح لكيفية جمعنا لمعلومات التعريف الشخصية الخاصة بك أو استخدامها أو حمايتها أو التعامل معها بطريقة أخرى وفقًا لموقعنا على الويب.
// ما هي المعلومات الشخصية التي نجمعها من الأشخاص الذين يزورون موقعنا؟
// عند التسجيل على موقعنا ، قد يُطلب منك إدخال اسمك أو عنوان بريدك الإلكتروني أو تفاصيل أخرى لمساعدتك في تجربتك.
// متى نجمع المعلومات؟
// نقوم بجمع معلومات منك عندما تقوم بالتسجيل على موقعنا ، أو الاشتراك في رسالة إخبارية ، أو الرد على استطلاع ، أو ملء نموذج أو إدخال معلومات على موقعنا.
// كيف نستعمل معلوماتك؟
// قد نستخدم المعلومات التي نجمعها منك عند التسجيل ، أو الاشتراك في النشرة الإخبارية ، أو الرد على استبيان أو اتصال تسويقي ، أو تصفح الموقع ، أو استخدام بعض ميزات الموقع الأخرى بالطرق التالية:
// ●	لإضفاء الطابع الشخصي على تجربتك والسماح لنا بتقديم نوع عروض المحتوى التي تهتم بها أكثر.
// ●	لتحسين موقعنا من أجل خدمتك بشكل أفضل.
// ●	للمتابعة معهم بعد المراسلات (محادثة مباشرة أو بريد إلكتروني أو استفسارات هاتفية)
// كيف نحمي معلوماتك؟
// نحن نقدم فقط المقالات والمعلومات. نحن لا نطلب أرقام بطاقات الائتمان أبدًا.
// نستخدم الفحص المنتظم للبرامج الضارة.
// نحن لا نستخدم شهادة SSL
// هل نستخدم ملفات تعريف الارتباط؟
// نعم. ملفات تعريف الارتباط هي ملفات صغيرة ينقلها الموقع أو مزود الخدمة إلى القرص الصلب بجهاز الكمبيوتر الخاص بك من خلال متصفح الويب الخاص بك (إذا سمحت بذلك) والتي تمكن أنظمة الموقع أو مزود الخدمة من التعرف على متصفحك والتقاط وتذكر بعض المعلومات يتم استخدامها أيضًا لمساعدتنا في فهم تفضيلاتك بناءً على نشاط الموقع السابق أو الحالي ، مما يمكننا من تزويدك بخدمات محسنة. نستخدم أيضًا ملفات تعريف الارتباط لمساعدتنا في تجميع البيانات المجمعة حول حركة مرور الموقع والتفاعل مع الموقع حتى نتمكن من تقديم تجارب وأدوات أفضل للموقع في المستقبل.
// نحن نستخدم ملفات تعريف الارتباط من أجل:
// ●	تتبع الإعلانات.
// يمكنك اختيار أن يقوم جهاز الكمبيوتر الخاص بك بتحذيرك في كل مرة يتم فيها إرسال ملف تعريف ارتباط ، أو يمكنك اختيار إيقاف تشغيل جميع ملفات تعريف الارتباط. يمكنك القيام بذلك من خلال إعدادات المتصفح الخاص بك. نظرًا لأن المتصفح مختلف قليلاً ، انظر إلى قائمة تعليمات المتصفح لمعرفة الطريقة الصحيحة لتعديل ملفات تعريف الارتباط.
// إذا قمت بإيقاف تشغيل ملفات تعريف الارتباط ، فسيتم تعطيل بعض الميزات. لن يؤثر ذلك على تجربة المستخدم التي تجعل تجربة موقعك أكثر كفاءة وقد لا تعمل بشكل صحيح.
// إفشاء الطرف الثالث
// نحن لا نبيع أو نتاجر أو ننقل معلوماتك الشخصية إلى أطراف خارجية. لا يشمل ذلك شركاء استضافة مواقع الويب والأطراف الأخرى التي تساعدنا في تشغيل موقعنا الإلكتروني أو إدارة أعمالنا أو خدمة مستخدمينا ، طالما أن هذه الأطراف توافق على الحفاظ على سرية هذه المعلومات. يجوز لنا أيضًا الإفصاح عن المعلومات عندما يكون إصدارها مناسبًا للامتثال للقانون أو فرض سياسات موقعنا أو حماية حقوقنا أو حقوق الآخرين أو ممتلكاتهم أو سلامتهم.
// ومع ذلك ، يمكن تقديم معلومات الزائر غير الشخصية إلى أطراف أخرى للتسويق أو الإعلان أو استخدامات أخرى
// روابط الطرف الثالث
// يحتوي الموقع على روابط لمواقع أخرى ليست مملوكة أو خاضعة لسيطرة موقع Gulf Goal لكننا لن نكون مسؤولين عن ممارسات الخصوصية للمواقع الأخرى
// بيان الخصوصية هذا ينطبق فقط على المعلومات التي يجمعها الموقع. لا تنطبق على إعلانات الجهات الخارجية التي تظهر على مواقعنا الإلكترونية.
// جوجل
// يمكن تلخيص متطلبات إعلانات Google من خلال مبادئ Google الإعلانية. لقد تم وضعها لتوفير تجربة إيجابية للمستخدمين. https://support.google.com/adwordspolicy/answer/1316548؟hl=ar
// نحن نستخدم إعلانات Google AdSense على موقعنا.
// تستخدم Google ، بصفتها بائعًا خارجيًا ، ملفات تعريف الارتباط لخدمة الإعلانات على موقعنا. يمكّن استخدام Google لملف تعريف الارتباط DART من عرض الإعلانات لمستخدمينا استنادًا إلى الزيارات السابقة لموقعنا والمواقع الأخرى على الإنترنت. يمكن للمستخدمين إلغاء الاشتراك في استخدام ملف تعريف الارتباط DART من خلال زيارة سياسة الخصوصية الخاصة بإعلانات Google وشبكة المحتوى.
// الانسحاب:
// يمكن للمستخدمين تعيين تفضيلات لكيفية قيام Google بالإعلان لك باستخدام صفحة إعدادات إعلانات Google. بدلاً من ذلك ، يمكنك إلغاء الاشتراك عن طريق زيارة صفحة إلغاء الاشتراك في مبادرة الإعلان على الشبكة أو باستخدام متصفح إلغاء الاشتراك في Google Analytics.
// نتفق على ما يلي:
// ●	يمكن للمستخدمين زيارة موقعنا بشكل مجهول.
// ●	بمجرد إنشاء سياسة الخصوصية هذه ، سنضيف رابطًا إليها على صفحتنا الرئيسية أو كحد أدنى ، في أول صفحة مهمة بعد دخول موقعنا.
// ●	يشتمل رابط سياسة الخصوصية على كلمة “الخصوصية” ويمكن العثور عليه بسهولة في الصفحة المحددة أعلاه.
// سيتم إخطارك بأي تغييرات في سياسة الخصوصية:
// ●	على صفحة سياسة الخصوصية الخاصة بنا
// يمكن تغيير معلوماتك الشخصية:
// ●	عن طريق تسجيل الدخول إلى حسابك
// كيف يتعامل موقعنا مع إشارات عدم التتبع؟
// نحن نحترم إشارات عدم التتبع ولا نتعقب أو ننتج ملفات تعريف الارتباط أو نستخدم الإعلانات عندما تكون آلية متصفح عدم التعقب (DNT) في مكانها الصحيح.
// هل يسمح موقعنا بتتبع سلوك طرف ثالث؟
// من المهم أيضًا ملاحظة أننا لا نسمح بتتبع سلوك الجهات الخارجية
// ممارسات المعلومات العادلة
// تشكل مبادئ ممارسات المعلومات العادلة العمود الفقري لقانون الخصوصية في الولايات المتحدة ، وقد لعبت المفاهيم التي تتضمنها دورًا مهمًا في تطوير قوانين حماية البيانات حول العالم. يعد فهم مبادئ الممارسة العادلة للمعلومات وكيفية تنفيذها أمرًا بالغ الأهمية للامتثال لقوانين الخصوصية المختلفة التي تحمي المعلومات الشخصية.
// من أجل التماشي مع ممارسات المعلومات العادلة ، سنتخذ الإجراء المتجاوب التالي ، في حالة حدوث خرق للبيانات:
// سوف نخطرك عبر البريد الإلكتروني
// ●	في غضون 7 أيام عمل
// نوافق أيضًا على مبدأ التعويض الفردي الذي يتطلب أن يكون للأفراد الحق في متابعة الحقوق القابلة للتنفيذ قانونًا ضد جامعي البيانات والمعالجات الذين لا يلتزمون بالقانون. لا يتطلب هذا المبدأ فقط أن يكون للأفراد حقوق قابلة للتنفيذ ضد مستخدمي البيانات ، بل يتطلب أيضًا أن يلجأ الأفراد إلى المحاكم أو الوكالات الحكومية للتحقيق و / أو مقاضاة عدم امتثال معالجي البيانات.
// إذا كنت ترغب في أي وقت في إلغاء الاشتراك من تلقي رسائل البريد الإلكتروني المستقبلية ، يمكنك مراسلتنا عبر البريد الإلكتروني على
// ●	اتبع التعليمات الموجودة في الجزء السفلي من كل بريد إلكتروني. وسنزيلك على الفور من جميع المراسلات.
// الاتصال بنا
// إذا كانت هناك أي أسئلة بخصوص سياسة الخصوصية هذه ، يمكنك الاتصال بنا باستخدام المعلومات أدناه.
// info@gulfgoal.com
// جلف جول

// "
// );
